tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "maticzav/swift-graphql", "https://github.com/maticzav/swift-graphql.git"
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "pkgxdev/made"
tap "spicetify/tap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Mozilla CA bundle for Python
brew "certifi"
# Console Matrix
brew "cmatrix"
# Dependency Manager for PHP
brew "composer"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker"
# .NET Core
brew "dotnet"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Statically typed language for the Erlang VM
brew "gleam"
# GNOME Spreadsheet Application
brew "gnumeric"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, Dynamic Programming Language
brew "julia"
# Simple terminal UI for git commands
brew "lazygit"
# Rainbows and unicorns in your console!
brew "lolcat"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Cross-platform ncurses Spotify client written in Rust
brew "ncspot"
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Fast, highly customisable system info script
brew "neofetch"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Platform built on V8 to build network applications
brew "node@14"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Draw UML diagrams
brew "plantuml"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Python version management
brew "pyenv"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Strong open-source chess engine
brew "stockfish"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Play wordle in command-line
brew "wordle"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Code generator for SwiftGraphQL library
brew "maticzav/swift-graphql/swiftgraphql"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Run Anything
brew "pkgxdev/made/pkgx"
# Command-line tool to customize Spotify client
brew "spicetify/tap/spicetify-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Chromium based browser
cask "arc"
# UI wireframing tool
cask "balsamiq-wireframes"
# Menu bar icon organiser
cask "bartender"
# 3D creation suite
cask "blender"
# Performance analysis software
cask "blitz-gg"
# Workflow and Decision Automation Platform
cask "camunda-modeler"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Managed desktop virtualization solution
cask "citrix-workspace"
# Screen capturing tool
cask "cleanshot"
# Downloads videos and audio from websites
cask "clipgrab"
# Voice and text chat software
cask "discord"
# Tool to hide status bar icons
cask "dozer"
# Online diagram software
cask "drawio"
# Control your Elgato key lights
cask "elgato-control-center"
# Launcher for *Epic Games* games
cask "epic-games"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-pro"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Open-source video transcoder
cask "handbrake"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# Interface for reading and syncing eBooks
cask "kindle"
# GPU-based terminal emulator
cask "kitty"
# Software for Logitech devices
cask "logitech-options"
# App for designing HTML5 Scalable Vector Graphics
cask "macsvg"
# Extensible two-pane file manager
cask "marta"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Online collaborative whiteboard platform
cask "miro"
# CSV editor
cask "modern-csv"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Retro video game emulation
cask "openemu"
# GUI prototyping tool
cask "pencil"
# Podcast platform
cask "pocket-casts"
# Collaboration platform for API development
cask "postman"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# .NET IDE
cask "rider"
# App that enables mouse-free UI interaction
cask "shortcat"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# General-purpose text editor
cask "textmate"
# Fantasy-themed turn-based strategy game
cask "the-battle-for-wesnoth"
# Platform for 3D content
cask "unity"
# Management tool for Unity
cask "unity-hub"
# Open-source code editor
cask "visual-studio-code"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Bit torrent client
cask "vuze"
# Terminal emulator
cask "wave"
# JavaScript IDE
cask "webstorm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Wine wrapper built with SwiftUI
cask "whisky"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Tax declaration for the fiscal year 2022
cask "wiso-steuer-2023"
# Mind mapping and brainstorming tool
cask "xmind"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Dropover", id: 1355679052
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "Streaks", id: 963034692
mas "Xcode", id: 497799835
vscode "1yib.rust-bundle"
vscode "allanoricil.salesforce-soql-editor"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "chuckjonas.apex-pmd"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "financialforce.lana"
vscode "github.vscode-github-actions"
vscode "hubspot.hubl"
vscode "jebbs.plantuml"
vscode "mechatroner.rainbow-csv"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "orsenkucher.vscode-graphql"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-einstein-gpt"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-expanded"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "salesforce.sfdx-code-analyzer-vscode"
vscode "supermaven.supermaven"
vscode "tamasfe.even-better-toml"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscodevim.vim"
vscode "withfig.fig"
vscode "yoavbls.pretty-ts-errors"
