tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "spicetify/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Console Matrix
brew "cmatrix"
# Dependency Manager for PHP
brew "composer"
# Pack, ship and run any application as a lightweight container
brew "docker"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GNOME Spreadsheet Application
brew "gnumeric"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, Dynamic Programming Language
brew "julia"
# Simple terminal UI for git commands
brew "lazygit"
# Rainbows and unicorns in your console!
brew "lolcat"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Cross-platform ncurses Spotify client written in Rust
brew "ncspot"
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Fast, highly customisable system info script
brew "neofetch"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Platform built on V8 to build network applications
brew "node@14"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Strong open-source chess engine
brew "stockfish"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# CLI tool that moves files or folder to the trash
brew "trash"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Command-line tool to customize Spotify client
brew "spicetify/tap/spicetify-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Chromium based browser
cask "arc"
# UI wireframing tool
cask "balsamiq-wireframes"
# Web browser focusing on privacy
cask "brave-browser"
# Workflow and Decision Automation Platform
cask "camunda-modeler"
# Managed desktop virtualization solution
cask "citrix-workspace"
# Screen capturing tool
cask "cleanshot"
# Downloads videos and audio from websites
cask "clipgrab"
# Voice and text chat software
cask "discord"
# Tool to hide status bar icons
cask "dozer"
# Online diagram software
cask "drawio"
# Launcher for *Epic Games* games
cask "epic-games"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Typeface made for developers
cask "font-jetbrains-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Desktop customization tool
cask "geektool"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Interface for reading and syncing eBooks
cask "kindle"
# Software for Logitech devices
cask "logitech-options"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal browser that protects privacy
cask "min"
# Online collaborative whiteboard platform
cask "miro"
# CSV editor
cask "modern-csv"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# GUI prototyping tool
cask "pencil"
# Podcast platform
cask "pocket-casts"
# Collaboration platform for API development
cask "postman"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# App that enables mouse-free UI interaction
cask "shortcat"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# General-purpose text editor
cask "textmate"
# Fantasy-themed turn-based strategy game
cask "the-battle-for-wesnoth"
# Open-source code editor
cask "visual-studio-code"
# Bit torrent client
cask "vuze"
# Native desktop client for WhatsApp
cask "whatsapp"
# Tax declaration for the fiscal year 2022
cask "wiso-steuer-2023"
# Video communication and virtual meeting platform
cask "zoom"
mas "Dropover", id: 1355679052
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
vscode "1YiB.rust-bundle"
vscode "allanoricil.salesforce-soql-editor"
vscode "Catppuccin.catppuccin-vsc"
vscode "chuckjonas.apex-pmd"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "FinancialForce.lana"
vscode "mechatroner.rainbow-csv"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-einstein-gpt"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-expanded"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "salesforce.sfdx-code-analyzer-vscode"
vscode "serayuzgur.crates"
vscode "vscodevim.vim"
vscode "withfig.fig"
